/**
 * 数值控件的计算类型
 */
export const normTypes = [
  {
    text: _l('总计'),
    alias: _l('求和'),
    value: 1,
  },
  {
    text: _l('最大值'),
    value: 2,
  },
  {
    text: _l('最小值'),
    value: 3,
  },
  {
    text: _l('平均值'),
    value: 4,
  },
  {
    text: _l('计数'),
    value: 5,
  },
  {
    text: _l('去重计数'),
    value: 6,
  },
];

export const defaultNumberChartStyle = {
  textAlign: 'center',
  columnCount: 4,
  fontSize: 28,
  fontColor: '#151515',
  titleColor: '#151515',
  contrastColor: 0,
  contrastValueDot: 2,
  lastContrastText: _l('环比'),
  contrastText: _l('同比'),
  shape: 'square',
  iconVisible: false,
  iconColor: '#1677ff',
  icon: '3_1_coins',
};

export const sizeTypes = [
  {
    name: _l('小'),
    value: 20,
    titleValue: 15,
  },
  {
    name: _l('默认'),
    value: 28,
    titleValue: 15,
  },
  {
    name: _l('中'),
    value: 42,
    titleValue: 18,
  },
  {
    name: _l('大'),
    value: 80,
    titleValue: 24,
  },
  {
    name: _l('超大'),
    value: 120,
    titleValue: 32,
  },
];

export const defaultPivotTableStyle = {
  cellTextAlign: 'right',
  columnTextAlign: 'left',
  lineTextAlign: 'left',
  columnTextColor: '#757575',
  columnBgColor: '#fafafa',
  lineTextColor: '#151515',
  lineBgColor: '#fff',
  evenBgColor: '#fafcfd',
  oddBgColor: '#ffffff',
  textColor: '#000000d9',
};

export const countryLayerCodeMap = {
  810100: 810000, // 香港岛 -> 香港特别行政区（上级）
  810101: 810001, // 中西区
  810111: 810001, // 坚尼地城 -> 中西区
  810112: 810001, // 石塘咀 -> 中西区
  810113: 810001, // 西营盘 -> 中西区
  810114: 810001, // 上环 -> 中西区
  810115: 810001, // 中环 -> 中西区
  810116: 810001, // 金钟 -> 中西区
  810117: 810001, // 半山区 -> 中西区
  810118: 810001, // 山顶 -> 中西区

  810102: 810002, // 湾仔区
  810121: 810002, // 湾仔 -> 湾仔区
  810122: 810002, // 铜锣湾 -> 湾仔区
  810123: 810002, // 跑马地 -> 湾仔区
  810124: 810002, // 大坑 -> 湾仔区
  810125: 810002, // 扫杆埔 -> 湾仔区
  810126: 810002, // 渣甸山 -> 湾仔区

  810103: 810003, // 东区
  810131: 810003, // 天后 → 东区
  810132: 810003, // 宝马山 → 东区
  810133: 810003, // 北角 → 东区
  810134: 810003, // 鲗鱼涌 → 东区
  810135: 810003, // 西湾河 → 东区
  810136: 810003, // 筲箕湾 → 东区
  810137: 810003, // 柴湾 → 东区
  810138: 810003, // 小西湾 → 东区

  810104: 810004, // 南区
  810141: 810004, // 薄扶林 → 南区
  810142: 810004, // 香港仔 → 南区
  810143: 810004, // 鸭脷洲 → 南区
  810144: 810004, // 黄竹坑 → 南区
  810145: 810004, // 寿臣山 → 南区
  810146: 810004, // 浅水湾 → 南区
  810147: 810004, // 香港仔（重复出现时同样映射） → 南区 （如有）
  810148: 810004, // 赤柱 → 南区
  810149: 810004, // 大潭 → 南区
  810140: 810004, // 石澳 → 南区

  810200: 810000, // 九龙 -> 香港特别行政区（上级）
  810201: 810005, // 油尖旺区
  810211: 810005, // 尖沙咀 → 油尖旺区
  810212: 810005, // 油麻地 → 油尖旺区
  810213: 810005, // 西九龙填海区 → 油尖旺区
  810214: 810005, // 京士柏 → 油尖旺区
  810215: 810005, // 旺角 → 油尖旺区
  810216: 810005, // 大角咀 → 油尖旺区

  810202: 810006, // 深水埗区
  810221: 810006, // 美孚 → 深水埗区
  810222: 810006, // 荔枝角 → 深水埗区
  810223: 810006, // 长沙湾 → 深水埗区
  810224: 810006, // 深水埗 → 深水埗区
  810225: 810006, // 石硖尾 → 深水埗区
  810226: 810006, // 又一村 → 深水埗区
  810227: 810006, // 大窝坪 → 深水埗区
  810228: 810006, // 昂船洲 → 深水埗区

  810203: 810007, // 九龙城区
  810231: 810007, // 红磡 → 九龙城区
  810232: 810007, // 土瓜湾 → 九龙城区
  810233: 810007, // 马头角 → 九龙城区
  810234: 810007, // 马头围 → 九龙城区
  810235: 810007, // 启德 → 九龙城区
  810236: 810007, // 九龙城 → 九龙城区
  810237: 810007, // 何文田 → 九龙城区
  810238: 810007, // 九龙塘 → 九龙城区
  810239: 810007, // 笔架山 → 九龙城区

  810204: 810008, // 黄大仙区
  810241: 810008, // 新蒲岗 → 黄大仙区
  810242: 810008, // 黄大仙 → 黄大仙区
  810243: 810008, // 东头 → 黄大仙区
  810244: 810008, // 横头坳 → 黄大仙区
  810245: 810008, // 乐富 → 黄大仙区
  810246: 810008, // 钻石山 → 黄大仙区
  810247: 810008, // 慈云山 → 黄大仙区
  810248: 810008, // 牛池湾 → 黄大仙区

  810205: 810009, // 观塘区
  810251: 810009, // 坪石 → 观塘区
  810252: 810009, // 九龙湾 → 观塘区
  810253: 810009, // 牛头角 → 观塘区
  810254: 810009, // 佐敦谷 → 观塘区
  810255: 810009, // 观塘 → 观塘区
  810256: 810009, // 秀茂坪 → 观塘区
  810257: 810009, // 蓝田 → 观塘区
  810258: 810009, // 油塘 → 观塘区
  810259: 810009, // 鲤鱼门 → 观塘区

  810300: 810000, // 新界 -> 香港特别行政区（上级）
  810301: 810010, // 荃湾区
  810311: 810010, // 荃湾 → 荃湾区
  810312: 810010, // 梨木树 → 荃湾区
  810313: 810010, // 汀九 → 荃湾区
  810314: 810010, // 深井 → 荃湾区
  810315: 810010, // 青龙头 → 荃湾区
  810316: 810010, // 马湾 → 荃湾区
  810317: 810010, // 欣澳 → 荃湾区

  810302: 810011, // 屯门区
  810321: 810011, // 大榄涌 → 屯门区
  810322: 810011, // 扫管笏 → 屯门区
  810323: 810011, // 屯门 → 屯门区
  810324: 810011, // 蓝地 → 屯门区

  810303: 810012, // 元朗区
  810331: 810012, // 洪水桥 → 元朗区
  810332: 810012, // 屋村 → 元朗区
  810333: 810012, // 流浮山 → 元朗区
  810334: 810012, // 天水围 → 元朗区
  810335: 810012, // 元朗 → 元朗区
  810336: 810012, // 新田 → 元朗区
  810337: 810012, // 落马洲 → 元朗区
  810338: 810012, // 锦田 → 元朗区
  810339: 810012, // 石岗 → 元朗区
  810330: 810012, // 八乡 → 元朗区

  810304: 810013, // 北区
  810341: 810013, // 粉岭 → 北区
  810342: 810013, // 联和墟 → 北区
  810343: 810013, // 上水 → 北区
  810344: 810013, // 石湖墟 → 北区
  810345: 810013, // 沙头角 → 北区
  810346: 810013, // 鹿颈 → 北区
  810347: 810013, // 乌蛟腾 → 北区

  810305: 810014, // 大埔区
  810351: 810014, // 大埔墟 → 大埔区
  810352: 810014, // 大埔 → 大埔区
  810353: 810014, // 大埔滘 → 大埔区
  810354: 810014, // 大尾笃 → 大埔区
  810355: 810014, // 船湾 → 大埔区
  810356: 810014, // 梅子林 → 大埔区
  810357: 810014, // 仔峪下 → 大埔区

  810306: 810015, // 西贡区
  810361: 810015, // 清水湾 → 西贡区
  810362: 810015, // 西贡 → 西贡区
  810363: 810015, // 大网仔 → 西贡区
  810364: 810015, // 将军澳 → 西贡区
  810365: 810015, // 坑口 → 西贡区
  810366: 810015, // 调景岭 → 西贡区
  810367: 810015, // 马游塘 → 西贡区

  810307: 810016, // 沙田区
  810371: 810016, // 大围 → 沙田区
  810372: 810016, // 沙田 → 沙田区
  810373: 810016, // 火炭 → 沙田区
  810374: 810016, // 马料水 → 沙田区
  810375: 810016, // 乌溪沙 → 沙田区
  810376: 810016, // 马鞍山 → 沙田区

  810308: 810017, // 葵青区
  810381: 810017, // 葵涌 → 葵青区
  810382: 810017, // 青衣 → 葵青区

  810309: 810018, // 离岛区
  810391: 810018, // 长洲 → 离岛区
  810392: 810018, // 坪洲 → 离岛区
  810393: 810018, // 大屿山 → 离岛区
  810394: 810018, // 南丫岛 → 离岛区

  820100: 820000, // 澳门半岛 -> 澳门特别行政区（上级）
  820101: 820001, // 花地玛堂区
  820111: 820001, // 青洲区 → 花地玛堂区
  820112: 820001, // 台山区 → 花地玛堂区
  820113: 820001, // 黑沙环及祐汉区 → 花地玛堂区
  820114: 820001, // 黑沙环新填海区 → 花地玛堂区
  820115: 820001, // 望厦及水塘区 → 花地玛堂区
  820116: 820001, // 筷子基区 → 花地玛堂区

  820102: 820002, // 花王堂区
  820121: 820002, // 林茂塘区 → 花王堂区
  820122: 820002, // 高士德及雅廉访区 → 花王堂区
  820123: 820002, // 新桥区 → 花王堂区
  820124: 820002, // 沙梨头及大三巴区 → 花王堂区

  820103: 820003, // 望德堂区
  820131: 820003, // 荷兰园区 → 望德堂区
  820132: 820003, // 东望洋区 → 望德堂区

  820104: 820004, // 大堂区
  820141: 820004, // 新口岸区 → 大堂区
  820142: 820004, // 外港及南湾湖新填海区 → 大堂区
  820143: 820004, // 中区 → 大堂区

  820105: 820005, // 风顺堂区
  820151: 820005, // 下环区 → 风顺堂区
  820152: 820005, // 南西湾及主教山区 → 风顺堂区

  820200: 820000, // 离岛 -> 澳门特别行政区（上级）
  820201: 820006, // 嘉模堂区
  820211: 820006, // 海洋及小潭山区 → 嘉模堂区
  820212: 820006, // 氹仔中心区 → 嘉模堂区
  820213: 820006, // 大学及北安湾区 → 嘉模堂区
  820214: 820006, // 北安及大潭山区 → 嘉模堂区
  820215: 820006, // 氹仔旧城区及马场区 → 嘉模堂区
  820216: 820006, // 新城区及罗区 → 嘉模堂区
  820217: 820006, // 澳门大学新城区 → 嘉模堂区
  820218: 820006, // 横琴口岸及澳门口岸区 → 嘉模堂区

  820203: 820008, // 圣方济各堂区
  820231: 820008, // 路环区 → 圣方济各堂区
  820232: 820008, // 路氹填海区 → 圣方济各堂区
};
